Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བཙུན་པ་དེང་སླན་ཆད་བདག་གིས་རྒྱལ་པོའི་ཁབ་ཀྱི་མི་རྣམས་ལ་བསྲུང་བ་དང་བསྐྱབ་པར་འཚལ་ལོ་ཞེས་གསོལ་ནས།
en: “Lord, from this day forth I shall guard and protect the people of Rājagṛha.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་ནས་དེ་རང་གི་གནས་སུ་སོང་སྟེ་འདུག་གོ། །
en: Then he touched his head to the Blessed One’s feet, took leave of the Blessed One, went back whence he came, and there he stayed.

source: དེ་དེ་ན་འདུག་ནས་བསམས་པ།
en: The yakṣa then thought,

source: དྲང་སྲོང་ནག་པོ་དེ་དཀའ་ཐུབ་དོན་མེད་པ།
en: “Sage Black’s austerities are futile.”

source: འདིས་ཉོན་མོངས་པའི་སྟེང་དུ་ཞག་བདུན་ན་འཆི་བར་མཐོང་ནས།
en: For he saw that in seven days Sage Black would be dead.

source: དེ་དེ་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་དེའི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: Out of love, he went to see him and said,

source: དྲང་སྲོང་ཁྱོད་ཀྱི་དཀའ་ཐུབ་དྲག་པོ་འདི་ཅི་དགོས།
en: “Sage, what is the use of all your severe austerities?

source: དེའི་སྟེང་དུ་ཁྱོད་ད་སྟེ་ཞག་བདུན་ན་འཆི་བར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: For seven days from now you will be dead.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དྲང་སྲོང་དེ་སྡུག་བསྔལ་ཆེན་པོ་སྐྱེས་ནས།
en: The sage was devastated to hear this.

source: དེ་མྱ་ངན་གྱི་དབང་གིས་རྫུ་འཕྲུལ་དེ་ལས་ཉམས་ཏེ། དེ་གཞི་དེ་ལས་ལྷག་པར་ཡང་མྱ་ངན་སྐྱེས་ནས་
en: Overcome by sadness, he lost his miraculous powers, and this caused him extraordinary sorrow.

source: ཤིན་ཏུ་སྨྲེ་སྔགས་འདོན་ཅིང་འདུག་གོ། །
en: He sat there wailing

source: དེ་ནས་གནོད་སྦྱིན་དེས་སྨྲས་པ།
en: until the yakṣa told him,

source: དྲང་སྲོང་ཧ་ཅང་མྱ་ངན་མ་བྱེད།
en: “Don’t be so sad, sage.

source: ཧ་ཅང་མྱ་ངན་མ་བྱེད།
en: Don’t be troubled.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ།
en: The Blessed One is staying in Rājagṛha.

source: དེ་ནི་འཆི་བར་འགྱུར་བའི་ལམ་མཁྱེན་པ་ཡིན་གྱིས།
en: He knows the course your death will take.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་སོང་ཤིག་དང་། དེས་ན་ཁྱོད་ལ་ལེགས་པ་ཐམས་ཅད་མཛད་པར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: Take refuge in the Blessed Buddha and all good things will be done for you.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དྲང་སྲོང་ནག་པོས་ཐམས་ཅད་སྤངས་ཏེ་འོད་མའི་ཚལ་དུ་སོང་ངོ་། །
en: As soon as he heard this, Sage Black cast all else aside and went to Bamboo Grove,

source: དེ་ནས་དྲང་སྲོང་ནག་པོས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ། མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ། མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ། བློ་གསལ་ཞིང་དྲི་མ་མེད་ལ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: Sage Black saw the Blessed Buddha in the distance. His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like flames stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels. He was immaculate, clear-minded, and pure of heart.

source: མཐོང་ནས་ཀྱང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ། དགེ་བའི་རྩ་བ་བསགས་པའི་རྒྱུ་ལས་བྱུང་བའི་སེམས་ཅན་གྱིས་དང་པོ་སངས་རྒྱས་མཐོང་བའི་ཉམས་བདེ་བ་ཇི་འདྲ་བ་དེ་ལྟ་བུ་ནི་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཞི་གནས་ཀྱི་སེམས་ལ་གོམས་པར་བྱས་པ་ལ་ཡང་ཉམས་བདེ་བ་དེ་ལྟ་བུ་སྐྱེ་བར་མི་འགྱུར་རོ། །
en: When he saw the Blessed Buddha the sight of him filled him with supreme joy, for beings who have gathered the roots of virtue to see a buddha for the first time experience such rapture as is not to be had even by those who practice calm abiding meditation for twelve years.

source: དེ་ལྟར་མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: Seeing the Blessed Buddha in this way, Sage Black was again filled with supreme joy.

source: དེ་དགའ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: Full of such joy he went to see the Blessed One, touched his head to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་། ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended his thoughts, habitual tendencies, temperament, capacity, and nature, and taught him the Dharma accordingly.

source: དེ་ནས་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: With the words “Come, join me, monk!” the Blessed One led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་དྲང་སྲོང་འདི་འཆི་བས་འཇིགས་ཤིང་སྐྲག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་མཆིས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་རབ་ཏུ་ཕྱུང་ནས་གཡུང་དྲུང་གི་མཐར་ཐུག་པ། གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་པ་ལ་གཟིགས།
en: “Lord,” the monks requested the Blessed One, “tell us why this sage who was terrified of dying approached the Blessed One, whereupon the Blessed One led him to go forth and established him in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། ཇི་ལྟར་འདས་པའི་དུས་ན་ཡང་འདི་ཉིད་འཆི་བས་འཇིགས་ཤིང་སྐྲག་ནས་ངས་རབ་ཏུ་ཕྱུང་སྟེ། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way he was terrified of dying, and I led him to go forth and placed him in the four meditative states and five superknowledges.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། དཀའ་ཐུབ་ཀྱི་གནས་ཞིག་ན་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ། རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་གནས་པ་དེའི་སློབ་མ་བྲམ་ཟེའི་ཁྱེའུ་ལེ་ལོ་ཅན་ཚེ་ཐུང་ངུ་ཞིག་ཡོད་དེ
en: “Monks, in times gone by, there lived a sage in a certain hermitage who had all the five superknowledges—a person of great miracles and great power. He had one disciple, a young brahmin who was lazy and whose life was short.

source: དེས་དེ་ལ་ལུང་ཕོག་ཀྱང་དེ་ལེ་ལོ་ཆེ་བའི་ཕྱིར་སྒྲིམ་དུ་མི་བཏུབ་བོ། །
en: Even when he was being instructed, because of his exceptional laziness he could not stay focused.

source: དེ་ནས་ཕྱི་ཞིག་ན་དྲང་སྲོང་དེས་བལྟས་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེ་ཞག་བདུན་ན་འཆི་བར་འགྱུར་བར་མཐོང་ལ།
en: “One day the sage looked out and saw that in seven days the young brahmin would be dead.

source: དེས་ཅི་ཡང་མ་ཐོབ་པར་རིག་ནསདེས་དེ་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་སྨྲས་པ།
en: Knowing that he had not achieved anything at all, in order that the young brahmin might become disillusioned with saṃsāra, he said to him,

source: བྲམ་ཟེའི་ཁྱེའུ་ལེ་ལོ་མ་བྱེད་ཅིག །ཁྱོད་ཞག་བདུན་ན་འཆི་བར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: ‘Don’t be lazy, young brahmin, for in seven days you will die.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བྲམ་ཟེའི་ཁྱེའུ་དེ་ཤིན་ཏུ་མི་དགའ་བར་གྱུར་ཏེ། མི་དགའ་བར་གྱུར་པ་དེས་ན་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: “When the young brahmin heard this, he was filled with deep sadness, and because of his deep sadness he generated the four meditative states and the five superknowledges.

source: དེའི་ཚེ་བྲམ་ཟེའི་ཁྱེའུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ནག་པོ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that young brahmin then is none other than Black himself.

source: དེའི་ཚེ་ཡང་འདི་འཆི་བས་འཇིགས་ཤིང་སྐྲག་ནས། ངས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཞག་གོ། །
en: At that time he was terrified of dying, and I placed him in the four meditative states and the five superknowledges.

source: ད་ལྟར་ཡང་འདི་འཆི་བས་འཇིགས་ཤིང་སྐྲག་ནས་ངས་རབ་ཏུ་ཕྱུང་སྟེ། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་གོ། །
en: Now as well he was terrified of dying, and I have led him to go forth and established him in the unsurpassed, supreme welfare of nirvāṇa.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་རབ་ཏུ་བྱུང་བར་གྱུར་ཏེ།
en: “He also went forth in the doctrine of Buddha Kāśyapa.

source: དེར་འདིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་དང་དབང་པོ་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ན་ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: After practicing pure conduct all his life then, his faculties ripened, and now they have been liberated.”

source: མདའ་ཐོགས་ཞེས་བྱ་བ་ནི།
en: The Story of Iṣudhara

source: ཡུལ་སེར་སྐྱའི་གནས་ན་ཤཱཀྱ་དབྱུག་ཐོགས་ཞེས་བྱ་བ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ།
en: In Kapilavastu there once lived a certain Śākya called Daṇḍadhara.

source: ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས།
en: He was prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ཏེ་
en: He took a wife of the same caste,

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་
en: and as they enjoyed themselves and coupled one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་ཁྱེའུ་འདི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: At the elaborate feast celebrating his birth they asked, “What name should we give this child?” And they named him, saying,

source: ཁྱེའུ་འདི་དབྱུག་ཐོགས་ཀྱི་བུ་ཡིན་པས་ན། ཁྱེའུ་འདིའི་མིང་མདའ་ཐོགས་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: “Since this is Daṇḍadhara’s child, his name will be Iṣudhara.”

source: དེ་ནས་ཁྱེའུ་མདའ་ཐོགས་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ནས་དེ་མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared him on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་ཐ་དད་པ་འདི་ལྟ་སྟེ། གླང་པོ་ཆེ་ཞོན་པ་དང་། རྟ་ཞོན་པ་དང་། མཚོན་ཆ་བཅང་བ་དང་། འཕང་བ་དང་། མདུན་དུ་བསྣུར་བ་དང་། ཕྱིར་བསྣུར་བ་དང་། གཡུལ་ལས་འབྱུང་བར་བྱ་བ་དང་། ལྕགས་ཀྱུ་གཟུང་བ་དང་། ཞགས་པ་གཟུང་བ་དང་། མདའ་བོ་ཆེ་འཕང་བ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་འཕང་བ་དང་། མཚོན་རྩེ་གཅིག་པ་གདབ་པ་དང་། འཁོར་ལོ་འཕང་བ་དང་། གཅད་པ་དང་། གཤེག་པ་དང་། ལག་པས་གཟུང་བ་དང་། རྐང་པའི་སྟངས་དང་། མགོ་བོ་བསྐྱབ་པ་དང་། རྒྱང་མར་འཕང་བ་དང་། སྒྲ་གྲགས་པར་འཕང་བ་དང་། གནད་དུ་འཕང་བ་དང་། གདོན་མི་ཟ་བར་ཕོག་པར་བྱ་བ་དང་། ཚབས་ཆེར་གཏང་བ་རྣམས་ཀྱང་བསླབས་ནས། གནས་ལྔ་ལ་བྱང་བར་གྱུར་ཏོ། །
en: As the young man grew up, they made him study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train, such as how to ride an elephant, how to ride horseback, how to wield a weapon, and how to shoot an arrow, advance, retreat, wage war, grasp with an iron hook, wield a lasso, shoot a spear, throw a single-pointed vajra, throw other single-pointed weapons, and throw a disk; how to cut, cleave, grapple and hold, employ footwork, guard one’s head, strike from a distance, and strike at the noise of an unseen enemy; and how to target the vital points, take infallible aim, and maximize damage. By the time he had been educated in all of these, he was learned in the five fields of knowledge.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཡང་ཤཱཀྱ་དབྱུག་ཐོགས་ཀྱི་ཆུང་མ་ལ། བུ་ཆགས་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ
en: One day Śākya Daṇḍadhara’s wife conceived again, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེ་བཙས་མ་ཐག་ཏུ། ཤཱཀྱ་ལག་ན་དབྱུག་ཐོགས་ཀྱི་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཁ་དོག་རྒྱས་པ། མཆོག་དང་ལྡན་པ་ཞིག་བཙས་སོ་ཞེས་བྱ་བའི་སྒྲ་སེར་སྐྱའི་གནས་ཐམས་ཅད་དུ་གྲགས་སོ། །
en: When she was born, it was immediately well known throughout Kapilavastu that Śākya Daṇḍadhara’s daughter was well proportioned, pleasing to the eye, and beautiful, with a most radiant complexion.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་བུ་མོ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: At the elaborate feast celebrating her birth they asked, “What name should we give this child?” And they named her, saying,

source: བུ་མོ་འདི་བཙས་པ་ན་སེར་སྐྱའི་གནས་ཐམས་ཅད་དུ་གཏམ་སྙན་པ་གྲགས་པས་ན། བུ་མོ་འདིའི་མིང་གྲགས་འཛིན་མར་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: “Since she was renowned all over Kapilavastu at birth, her name will be Yaśodharā.”

source: དེ་ནས་བུ་མོ་གྲགས་འཛིན་མ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ནས་དེ་མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared young Yaśodharā on milk, yogurt, butter, ghee, and milk solids, and she flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་བཙུན་མོར་ཕུལ་ལོ། །
en: Then when she had grown, she was given to the Bodhisattva in marriage.

source: དེ་ནས་གྲགས་འཛིན་མའི་རྐྱེན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་ཁྱེའུ་མདའ་ཐོགས་དང་ཤིན་ཏུ་མཛའ་བར་གྱུར་ཏོ། །
en: Through Yaśodharā, young Iṣudhara became good friends with the Bodhisattva,

source: དེ་ནས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་རྒན་པོ་དང་ནད་པ་དང་ཤི་བ་གཟིགས་ནས་ནགས་ཀྱི་ནང་དུ་གནས་བཅས་པ་དེའི་ཚེ། ཁྱེའུ་མདའ་ཐོགས་ཤིན་ཏུ་མི་དགའ་བར་གྱུར་ཏེ
en: so when the Bodhisattva witnessed old age, sickness, and death, and went to live in the forest, young Iṣudhara was very upset.

source: ཅི་ཞིག་མཐོང་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་དང་བདག་གི་སྲིང་མོ་བོར་ཏེ་རབ་ཏུ་བྱུང་ཞིག་གུ་སྙམ་མོ། །
en: “What was it he saw,” he wondered, “that he went forth, giving up the kingdom of a universal monarch and my sister both?”

source: དེ་ནས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་ནས། གདུལ་བར་བྱ་བའི་དོན་མཛད་ཅིང་སེར་སྐྱའི་གནས་སུ་གཤེགས་ཏེ།
en: When the Bodhisattva achieved unexcelled wisdom and began to act for the benefit of those to be tamed, he traveled to Kapilavastu.

source: ཡབ་སྲས་གདན་འཛོམ་པར་མཛད་པ་དེར། ཤཱཀྱ་སྟོང་ཕྲག་དུ་མ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་དོང་ངོ་། །
en: There he was reunited with his father and son, and thousands upon thousands of Śākyas went to see the Blessed One, offering their service and respect.

source: ཤཱཀྱ་མདའ་ཐོགས་ནི་སྔར་མི་དགའ་བར་གྱུར་པས། བཅོམ་ལྡན་འདས་ལ་ལྟ་ཞིང་འགྲོར་མ་བཏུབ་ནས་དེ་ཤཱཀྱ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ནན་གྱིས་ཁྲིད་ནས
en: Since he had been so upset, Śākya Iṣudhara did not wish to see the Blessed One, but the Śākyas insisted on bringing him before the Blessed One.

source: གཞོན་ནུ་མདའ་ཐོགས་ཀྱིས་ཀྱང་ཤཱཀྱ་རྣམས་ཀྱི་སེམས་བསྲུང་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་ལས་བསླབ་པའི་གཞི་ལྔ་མནོས་སོ། །
en: So as not to upset the Śākyas, the youth Iṣudhara went so far as to receive the five precepts from the Blessed One.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་སྔོན་མི་དགའ་བའི་ཕྱིར་བློ་སྐྱེས་པ།
en: Since he had previously been so upset, one day he thought,

source: བདག་གིས་དེ་ལས་བསླབ་པའི་གཞི་ལྔ་བླངས་མོད་ཀྱི། འོན་ཀྱང་བདག་གིས་དེའི་བསླབ་པའི་གཞི་ལྔར་མཚར་ཅིག་བསྲུང་མི་དགོས་སོ་སྙམ་ནས
en: “Though I did take the five fundamental precepts from him, it was a mistake, so there’s no reason I have to keep them.”

source: དེས་སྔོན་མི་དགའ་བའི་ཕྱིར་བསླབ་པའི་གཞི་ལྔ་ཉམས་པར་བྱས་སོ། །
en: Then, because he had previously been so upset, he broke the five fundamental precepts.

source: དེ་ནས་དེར་ཤཱཀྱ་རྣམས་ཀྱིས་ཚོར་ཏེ་བསླབ་པའི་གཞི་རྣམས་དེས་འདི་ལྟར་ཉམས་པར་བྱས་སོ་སྙམ་དུ་རིག་ནས།
en: Now, when the Śākyas heard this, they reflected on how he had broken the five fundamental precepts

source: དེ་དག་དེ་ལ་སྙིང་རྗེ་སྐྱེས་ཏེ་འདིས་བསླབ་པའི་གཞི་རྣམས་ཉམས་པར་བྱས་པས་སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་ན་མི་རུང་ངོ་སྙམ་མོ། །
en: and felt compassion for him. “It isn’t right that he should be reborn among the hell beings because he broke the fundamental precepts,” they thought.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཤཱཀྱ་མང་པོ་རྣམས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: So one day the Śākyas went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Upon their arrival they touched their heads to the Blessed One’s feet and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཤཱཀྱ་རྣམས་ཀྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once they had taken their seats to one side, the Śākyas beseeched the Blessed One, “Lord, Śākya Iṣudhara has broken the fundamental precepts.

source: བཙུན་པ་ཤཱཀྱ་མདའ་ཐོགས་ཀྱིས་ནི་བསླབ་པའི་གཞི་རྣམས་ཉམས་པར་བགྱིས་ཏེ་སྐྱེམས་འཚལ་ན།
en: He’s started drinking. Blessed One, attend to him.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་ཏེ་ངན་སོང་དུ་མི་མཆི་བར་མཛད་དུ་གསོལ།
en: We ask you, keep him from falling to lower realms.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཤཱཀྱ་མང་པོ་རྣམས་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: The Blessed One assented to the Śākyas by his silence.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་ཤཱཀྱ་མང་པོ་རྣམས་ཀྱིས་རིག་ནས།
en: Understanding that by his silence the Blessed One had given his assent, all the Śākyas rejoiced, praising this assurance from the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་ཅིང་རྗེས་སུ་ཡི་རང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་དོང་ངོ་། །
en: Then, after touching their heads to the Blessed One’s feet, they took leave of him.

source: དེའི་དབང་པོ་ཡོངས་སུ་སྨིན་པར་བྱ་དགོས་སོ་སྙམ་དུ་དགོངས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་རེ་ཞིག་དེ་ལ་ཅི་ཡང་བཀའ་མ་སྩལ་པ་ལས།
en: “I will ripen his faculties,” and for a while, the Blessed One did not speak to him at all.

source: ཚེའི་ལྷག་མ་ཞག་བདུན་ལུས་པར་གཟིགས་ནས། དེར་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Observing that he had only seven days left to live, the Blessed One declared to the monks,

source: ཤཱཀྱ་མདའ་ཐོགས་ནི་དེ་ནས་ཞག་བདུན་ན་འཆི་བར་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་ཏོ། །
en: “In seven days Śākya Iṣudhara will be dead.”

source: དེ་ནས་སྒྲ་དེ་འབྲུ་མར་བཙིར་བ་བཞིན་དུ་གྲགས་མ་ཐག་ཏུ་ཤཱཀྱ་མདའ་ཐོགས་ཀྱིས། བདག་ཞག་བདུན་ན་འཆི་བར་ལུང་བསྟན་ཏོ་ཞེས་ཐོས་ནས།
en: Word spread like oil pressed from grain that it had been prophesied that Śākya Iṣudhara would be dead in seven days.

source: དེ་བཅོམ་ལྡན་འདས་ལ་མ་དད་པར་གྱུར་ཏེ།
en: But he had no faith in the Blessed One,

source: ཁང་བཟངས་ཀྱི་སྟེང་ན་འདུག་ཅིང་སྐྱེས་པ་དང་མ་འདྲེས་པའི་རོལ་མོའི་སྒྲས་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: so he stayed up on the roof of his palatial home, enjoying himself with women and coupling to the sound of music without interacting with other people.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་
en: The Blessed One thought,

source: ངས་དེ་ལ་ཇེ་ཉན་ཐོས་ཆེན་པོ་དག་བཏང་ལ་ཕྱིས་ང་ཉིད་འགྲོ་བར་བྱའོ་སྙམ་དུ་དགོངས་ནས།
en: “First I shall send the greatest of my disciples to him, and then I shall go myself.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then spoke to Aniruddha, saying,

source: མ་འགགས་པ་ཁྱོད་སོང་ལ་ཤཱཀྱ་མདའ་ཐོགས་ལ་སོམས་ཤིག །
en: “Aniruddha, attend to Śākya Iṣudhara.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་བཙུན་པ་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ནས
en: “As you wish, Lord,” Venerable Aniruddha replied,

source: ཕྱི་བཞིན་འབྲང་བའི་དགེ་སློང་ཞིག་དང་ཤཱཀྱ་མདའ་ཐོགས་ཀྱི་ཁྱིམ་དུ་སོང་ངོ་། །
en: and he went to Śākya Iṣudhara’s house with other monks trailing behind him.

source: དེ་ནས་ཤཱཀྱ་མདའ་ཐོགས་ཀྱིས་དགེ་སློང་མ་འགགས་པ་བདག་གི་ཁྱིམ་དུ་འོངས་སོ་ཞེས་ཐོས་སོ། །
en: Śākya Iṣudhara heard that the monk Aniruddha had come there to his house.

source: ཐོས་ནས་ཀྱང་ཕུ་ནུ་བོ་ལ་དགའ་བའི་ཕྱིར་དེའི་ཐད་དུ་སོང་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: When he heard this, out of love for his younger brother Aniruddha, he went to him, bowed down at his feet, and sat before him to listen to the Dharma.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་དེ་ཡོངས་སུ་སྨིན་པར་འགྱུར་བའི་གཏམ་བྱས་ནས་ཕྱིར་སོང་ངོ་། །
en: Venerable Aniruddha gave a discourse that would ripen him, and departed.

source: དེ་ནས་ཕྱིས་ཉིན་ཞག་གཉིས་པ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀུན་དགའ་བོ་བཏང་ངོ་། །
en: On the second day, the Blessed One sent Ānanda,

source: ཞག་གསུམ་པ་ལ་ནི་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་བཏང་ངོ་། །
en: and on the third day Venerable Mahā­maudgalyāyana.

source: ཞག་བཞི་པ་ལ་ནི་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བཏང་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས།
en: On the fourth day he sent Venerable Śāriputra,

source: དེ་ལ་ཅི་ནས་དེ་བཅོམ་ལྡན་འདས་ལ་དད་པ་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་བསྟན་ནས་དེ་འཆི་བས་འཇིགས་ཤིང་སྐྲག་པར་གྱུར་ཏོ། །
en: and Venerable Śāriputra taught him the Dharma in such a way as to inspire faith in the Blessed One. Then Śākya Iṣudhara became terrified of his death.

source: དེ་ནས་ཞག་ལྔ་པ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་སེམས་ཐུགས་ཀྱིས་མཁྱེན་ནས། ཉིད་མདའ་ཐོགས་ཀྱི་ཁྱིམ་དུ་གཤེགས་སོ། །
en: On the fifth day, the Blessed One directly apprehended his mind and went to Iṣudhara’s house in person.

source: དེ་ནས་ཤཱཀྱ་མདའ་ཐོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ཐག་རིང་པོ་ཞིག་ནས་མཐོང་ངོ་། །
en: Śākya Iṣudhara saw the Blessed One from a distance,

source: མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: and, when he saw him, he felt a surge of joy toward the Blessed One.

source: དགའ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་གདན་བཤམས་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: In his joy he set up a seat for the Blessed One and called out to the Blessed One,

source: བཅོམ་ལྡན་འདས་ཚུར་གཤེགས་བཅོམ་ལྡན་འདས་གཤེགས་པ་ལེགས་སོ་ལེགས་སོ། །
en: “This way, Blessed One—if you please! Welcome, Blessed One, very good!

source: བཅོམ་ལྡན་འདས་གདན་བཤམས་པ་ལ་བཞུགས་སུ་གསོལ། །
en: Blessed One, please have a seat on this cushion I have prepared for you!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་གདན་བཤམས་པ་ལ་བཞུགས་ནས།
en: Once the Blessed One had taken his place on the seat prepared for him,

source: ཤཱཀྱ་མདའ་ཐོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Śākya Iṣudhara touched his head to the Blessed One’s feet,

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་ཤཱཀྱ་མདའ་ཐོགས་ལ་བཀའ་སྩལ་པ།
en: “Iṣudhara,” the Blessed One taught,

source: མདའ་ཐོགས་འདི་ལྟར་འཆི་བའི་འཇིགས་པ་འདི་ནི་འཇིགས་པ་རྣམས་ཀྱི་ནང་ན་ཕྲན་ཚེགས་ཙམ་དུ་ཟད་དོ། །
en: “among fears, the fear of death is but a minor one.

source: འདི་ལྟ་སྟེ། སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོ་དང་། ཡི་དགས་རྣམས་ཀྱི་ངན་སོང་གི་འཇིགས་པ་འདི་ནི་འཇིགས་པ་རྣམས་ཀྱི་ནང་ན་མཆོག་ཡིན་ནོ། །
en: Supreme among fears is the fear of birth among the hell beings, the animals, or the anguished spirits.”

source: དེས་གསོལ་པ། བཙུན་པ་སེམས་ཅན་དམྱལ་བ་དེ་དག་ཇི་ལྟ་བུ་ལགས།
en: “Lord,” he asked, “What is it like for the hell beings?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་རྫུ་འཕྲུལ་གྱིས་ཁྲིད་དེ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བརྒྱད་བསྟན་ནས། དེས་གསོལ་པ།
en: So that Iṣudhara might become disillusioned with saṃsāra, the Blessed One transported him with his miraculous powers and showed him the beings of the eight great hells. Śākya Iṣudhara asked,

source: བཙུན་པ་ལས་གང་གིས་འདིར་སྐྱེ་བར་འགྱུར་ལགས།
en: “Lord, what deeds cause one to take birth here?”

source: སྲོག་གཅོད་པ་ཀུན་ཏུ་བསྟེན་ཅིང་བསྒོམས་ཏེ། མང་དུ་བྱས་པས་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: “Those who inure themselves to the act of killing and commit it many times will take birth here.

source: གལ་ཏེ་དེ་ནས་ཤི་འཕོས་ནས་མི་རྣམས་དང་སྐལ་བ་མཉམ་པར་འདིར་སྐྱེས་ན་ཡང་ཚེ་ཐུང་བར་འགྱུར་རོ། །
en: Thereafter, whenever they die and transmigrate, they will take birth here again into the same conditions, and their lives will be short.”

source: དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས། དེ་ལ་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྒྱས་པར་བསྟན་ནས། དེ་ཐོས་མ་ཐག་ཏུ་དེ་ལྷག་པར་ཡང་འཇིགས་པ་སྐྱེས་ཏེ།
en: When the Blessed One showed him in detail the paths of the ten nonvirtuous actions in the same way, right away Iṣudhara became particularly afraid.

source: བདག་གིས་བཅོམ་ལྡན་འདས་ལས་བསླབ་པའི་གཞི་བླངས་པ་ལས་མ་བསྲུངས་ན། བདག་སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོ་དང་ཡི་དགས་རྣམས་སུ་སྐྱེ་བར་མི་འགྱུར་གྲང་སྙམ་དུ་བསམས་ནས།
en: “If you take the fundamental precepts from the Blessed One and don’t protect them,” he worried, “won’t you take birth as a hell being, an animal, or an anguished spirit?”

source: དེས་བསླབ་པ་ཉམས་པ་དེ་དག་བཤགས་ནས་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: So he confessed that he had broken all his precepts, and sat before the Blessed One to listen to the Dharma.

source: དེས་ན་ཤཱཀྱ་མདའ་ཐོགས་ཀྱིས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་སྟེ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: When he heard it he destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: དེས་བདེན་པ་མཐོང་སྟེ་ཤི་ནས་ལྷར་སྐྱེས་ཏེ།
en: Having seen the truths, after his death he immediately took rebirth as a god.
